/**
 * Объект с регулярными выражениями
 */
const regExp = {
  /**
   * Поиск совпадений для замены в адресе запроса квартирограммы
   * @desc /(:companyId)|(:houseId)/g
   */
  getQuartilegramParams: /(:companyId)|(:houseId)/g,
  /**
   * Валидация полей адреса и города (address, place)
   * @desc /^[а-яА-Я\s\d.;\-,:?!()"]+$/g
   */
  address: /^[а-яА-Я\s\d.;\-,:?!()"]+$/g,
  /**
   * Валидация ФИАС (fiasId)
   * @desc /\b[0-9a-f]{8}\b-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-\b[0-9a-f]{12}\b/g
   */
  fiasId: /^\b[0-9a-f]{8}\b-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-\b[0-9a-f]{12}\b$/g,
  /**
   * Валидация MAC (mac)
   * @desc /^([0-9A-F]{2}[:-]){5}([0-9A-F]{2})$/g
   */
  mac: /^([0-9a-fA-F]{2}[:-]){5}([0-9a-fA-F]{2})$/g,
  /**
   * Валидация IP адреса (host)
   * @desc /^\b\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\b$/g
   */
  host: /^\b\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\b$/g,
  /**
   * Валиданиция sip номера трубки
   * @desc /(^\++)|(\D+)/g
   */
  sipPhone: /(^\++)|(\D+)/g,
  /**
   * Парсинг значений диапазона значений из строки
   * @desc /(\d+)-(\d+)|(\d{1,})/g
   */
  parceRangeNumber: /(\d+)-(\d+)|(\d{1,})/g,
};

export default regExp;
